Tekla Open API Reference for Tekla Structures 2025
InputDefinition Properties
The DrawingPluginBase.InputDefinition type exposes the following members.
Properties
Name | Description
Type
 The type of the input the current instance contains.
ViewId
 The view object's identifier.
Top
See Also
Reference
DrawingPluginBase.InputDefinition Class
Tekla.Structures.Plugins Namespace